Repository: DomingoLlanes/pharinix
Catalog: etc/i18n/*.po
Languages: es

source: Module install path.
es: Ruta de instalación del módulo

source: Path to the installed module.
es: Ruta al módulo instalado.

source: Module meta information.
es: Meta información del módulo

source: Modifier user
es: Usuario modificador

source: Modified date
es: Fecha de modificación

source: User creator
es: Usuario creador

source: Creation date
es: Fecha de creación

source: Access
es: Acceso

source: Access control flags.
es: Banderas de control de acceso

source: Group
es: Grupo

source: Owner group
es: Grupo propietario

source: Owner
es: Propietario

source: Owner user
es: Usuario propietario

source: Title
es: Titulo

source: A title string for this node.
es: Una cadena de titulo para este nodo.

source: Version
es: Versión

source: Module version
es: Versión del módulo

source: Groups
es: Grupos

source: User groups
es: Grupos del usuario

source: Mail
es: Correo electrónico

source: User email to login.
es: Correo del usuario para iniciar sesión

source: Password
es: Clave

source: Password to access.
es: Clave para acceder

source: User name
es: Nombre de usuario

source: It can be any.
es: Puede ser cualquiera.

source: Language
es: Idioma

source: Primary user language
es: Idioma principal del usuario

source: Required server MIME type interface to use
es: Interface MIME del servidor requerida para usarse

source: I can't get response.
es: No obtuve respuesta.

source: Please, try with other interface type.
es: Por favor, pruebe con otro tipo de interface.

source: Remote API
es: API remota

source: Command
es: Comando

source: Parameter name
es: Nombre de parámetro

source: Value
es: Valor

source: Add parameter
es: Añadir parámetro

source: Execute
es: Ejecutar

source: Response
es: Respuesta

source: You can't execute '%s'.
es: No puede ejecutar '%s'.

source: Command '%s' not found
es: Comando '%s' no encontrado

source: Command base class
es: Clase base de comando

source: Can't open the directory: '%s'.
es: No se pudo abrir el directorio: '%s'

source: Can't delete the directory: '%s'.
es: No se pudo borrar el directorio: '%s'

source: Can't remove the file: '%s'.
es: No se pudo borrar el archivo: '%s'

source: Maximum stack depth exceeded
es: Alcanzada máxima profundidad de pila

source: State mismatch (invalid or malformed JSON)
es: Estado de error (JSON invalido o mal formado)

source: Control character error, possibly incorrectly encoded
es: Error de control de caracteres, posiblemente incorrectamente codificado

source: Syntax error
es: Error de sintaxis

source: Malformed UTF-8 characters, possibly incorrectly encoded
es: Caracteres UTF-8 mal formados, posiblemente incorrectamente codificado

source: Create
es: Crear

source: Read
es: Leer

source: Update
es: Actualizar

source: Delete
es: Borrar

source: All
es: Todos

source: Write
es: Escribir

source: 'cmd' parameter is required.
es: Se requiere el parametro 'cmd'

source: Add a command, with parameters, to the boot process. This will executed with each user petition.
es: Añade un comando, con parametros, al proceso de arranque. Será ejecutado con cada petición.

source: Command to execute
es: Comando a ejecutar

source: Post string to put in the command.
es: Cadena POST a añadir al comando.

source: Priority of execution.
es: Prioridad de ejecución.

source: Unique ID, with that we can delete the boot command later.
es: ID única, con ella podremos borrar el comando de arranque más tarde.

source: Meta '%s' is unknowed.
es: Meta '%s' desconocida.

source: Execute a serial of commands. The output of a command will be the input parameters of the next command. Always call to captureEndAll at the end.
es: Ejecuta una serie de comandos. La salida de un comando será los parámetros de entrada del siguiente comando. Siempre llama a captureEndAll al final.

source: Array of parameters to merge at the start.
es: Lista de parametro a mezclar al principio.

source: Array of commands and default parameters. This parameters, if any, will be merged with de output of previous command, with priority to this, and passed how combined parameters. Ex, [['nothing' => 'ignoredparam1=A&ignoredparam2=B'], ['nothing' => 'ignoredparam1=A&ignoredparam2=B'], ...]. If you pass how command '#clean' then batch clear the merged output.
es: Lista de comandos y parámetros por defecto. Estos parametros, si hay alguno, serán mezclados con la salida del comando anterior, con prioridad de este, y pasados como parámetros combinados. Ej: [['nothing' => 'ignoredparam1=A&ignoredparam2=B'], ['nothing' => 'ignoredparam1=A&ignoredparam2=B'], ...]. Si pasas como comando '#clean' entonces batch limpia la salida mezclada.

source: If is empty or not define the output will out in response, else will be passed how parameters to the command in this parameter. Ex: 'echoed' => 'echoJson' will echo to the browser a json representation of the response.
es: Si es vacío o no está definido la salida saldrá en la respuesta, sino será pasada como parametros al comando en este parámetro. Ej: 'echoed' => 'echoJson' mostrará al navegador una representación en json de la respuesta.

source: The final response of the batch.
es: La respuesta final de batch.

source: If error is set to FALSE, else will be unset.
es: Si hubo errores será FALSE, sino no estará definido.

source: If error is set to the error message, else will be unset.
es: Si hubo errores será el mensaje de error, sino no estará definido.

source: If error is set to a string with the command and her input parameters, else will be unset.
es: Si hubo errores esta definido como cadena con el comando y sus parámetros de entrada, sino no estará definido.

source: If any, capture the actual echo buffer and return.
es: Su alguno, captura el buffer de salida al navegador actual y lo devuelve.

source: The string captured.
es: La cadena capturada.

source: Ensure that all the echo buffer are close ignoring her contents.
es: Se asegura que todos los buffers de salida están cerrados ignorando su contenido.

source: Start a echo buffered capture. The capture methods have control about stack of calls, please execute 'captureEndAll' to ensure that all this buffers are closed.
es: Comienda la captura un buffer de salida. El motodo de captura tiene control sobre la pila de llamadas, por favor, ejecuta 'captureEndAll' para asegurar que todos los buffers quedan cerrados.

source: To change permission of command that is owned by you. To execute commands only Execution is considered.
es: Cambiar permisos de los comandos de los que eres propietario. Para ejecutar comandos solo se tiene en cuenta el permiso Ejecución.

source: Command that you need change permission.
es: Comando al que necesitas cambiar los permisos.

source: Integer with the new permissions.
es: Entero con los nuevos permisos.

source: TRUE if changed.
es: TRUE si ha cambiado.

source: Bad user id.
es: ID de usuario incorrecta.

source: Bad group id.
es: ID de grupo incorrecta.

source: You need ownership.
es: Necesitas ser propietario.

source: To change owner, and/or group, of the command.
es: Para cambiar el propietario, y/o el grupo, del comando.

source: Command that you need change ownership.
es: Comando al que necesitas cambiar de propietario.

source: Mail of the user or ID of the new owner. If it's null, or it is not set, command don't change it, to set to root you must value how 0, zero.
es: Correo de usuario o ID del nuevo usuario propietario. Si es null, o si no se pasa, el comando no lo cambia, para seleccionar a root debes pasarlo como 0, cero.

source: Title or ID of the group. If it's null, or it is not set, command don't change it, to set to root you must value how 0, zero.
es: Titulo o ID del grupo. Si es null, o se pasa, el comando no lo cambia, para seleccionar a root debes pasarlo como 0, cero.

source: URL is required.
es: Se requiere la URL.

source: cURL not installed.
es: cURL no está instalado.

source: Download a remote file from a HTTP or HTTPS URL. (Requires cURL installed in PHP.)
es: Descarga un archivo remoto desde una URL HTTP o HTTPS. (Requiere cURL instalado en PHP.)

source: URL of the file to download.
es: URL del archivo a descargar.

source: TRUE if the download is OK.
es: TRUE si la descarga fue bien.

source: If download error this contains the error message.
es: Si hubo un error este contiene el mensaje de error.

source: If download ok, contains the downloaded file path. Please remove the temporal file when finish with it.
es: Si la descarga fue bien, contiene la ruta al archivo descargado. Por favor, borre el archivo temporal cuando termine con él.

source: Delete a command from boot process.
es: Borra un comando del proceso de arranque.

source: Reference ID of the boot command.
es: ID de referencia del comando de arranque.

source: Echo to browser the JSON representation of parameters, try to change the HTTP header to Content-type: application/json.
es: Muestra al navegador la representación JSON de los parámetros, intenta cambiar la cabecera HTTP al tipo de contenido application/json.

source: It can receive any amount of parameters.
es: Puede recibir cualquier cantidad de parametros.

source: Echo to browser the print_r() representation of parameters, try to change the HTTP header to Content-type: text/plain.
es: Muestra al navegador la representación print_r() de los parámetros, intenta cambiar la cabecera HTTP al tipo de contenido text/plain.

source: Parse a page template and return her blocks places.
es: Interpreta una plantilla de página y devuelve sus espacios de bloques.

source: XML page to parse
es: Página XML a interpretar

source: Array of blocks places.
es: Lista de espacios de bloques.

source: Command's help as array.
es: Lista de ayudas de comandos.

source: Help grouped by bin path. array('bin/html' => array...)
es: Ayuda agrupada por rutas bin. array('bin/html' => array...)

source: Command's list as array filter by startby parameter.
es: Lista de comandos como array filtrados por el parámetro startby.

source: Filter by start of command name.
es: Filtrar por el comienzo del nombre de comando.

source: Result list
es: Lista de resultados

source: Get info about registered hook handlers.
es: Obtener información sobre los manejadores de hook registrados.

source: Hooks list.
es: Listado de Hooks.

source: Light weight framework with many interesting features. Data model with unix like security, configurable with it self, URL rewrite and mapping, etc... it's the perfect backend to your application.
es: Framework ligero con funciones muy interesantes. Modelo de datos con seguridad parecida a unix, configurable por si mismo, reescritura de URL y mapeo, etc... Es el backend perfecto para tu aplicación.

source: Return Pharinix version.
es: Devuelve la versión de Pharinix.

source: Pharinix version.
es: Versión de Pharinix.

source: Meta data information.
es: Información de meta datos.

source: Redirect the browser to home.
es: Redirecciona el navegador al inicio.

source: Redirect the browser to a 'local' URL.
es: Redirecciona el navegador a una URL 'local'.

source: The URL path to go to. Ex. 'help/console' to go to the console.
es: La ruta URL a la que ir. Ej. 'help/console' para ir a la consola.

source: Get a list of commands from boot process.
es: Obtener la lista de comandos del proceso de arranque.

source: Connection error.
es: Error de conexión.

source: Do a direct query to the local data base. IMPORTANT: This command is so dangerous !! Protect it with restrictive permissions, only root must execute it.
es: Hace una consultar diractamente a la base de datos local. IMPORTANE: Este comando es muy peligroso !! Protegelo con unos permisos restrictivos, solo root debe ejecutarlo.

source: Query.
es: Consulta.

source: Array with results.
es: Array con los resultados.

source: Command '%s' not found.
es: Comando '%s' no encontrado.

source: Unknowed
es: Desconocido

source: Get help about a command how array. Ex. man ('cmd' => 'man'). Get this help.
es: Obtiene ayuda sobre un comando como array. Ej. man('cmd' => 'man'). Obtiene esta ayuda.

source: The command to query.
es: El comando a consultar.

source: The help array.
es: El array de ayuda.

source: Get meta data from a module.
es: Obtiene los meta datos de un módulo.

source: Module name.
es: Nombre del módulo.

source: Get the instalation path of a module.
es: Obtiene la ruta de instalación de un módulo.

source: Module path.
es: Ruta del módulo.

source: Get the version of a module.
es: Obtiene la versión de un módulo.

source: Module version.
es: Versiòn del módulo.

source: Module zip file not found.
es: Archivo zip del módulo no encontrado.

source: Install path not found.
es: Ruta de instalación no encontrada.

source: Install path is in use.
es: La ruta de instalación está en uso.

source: Module '%s' is installed with version '%s'.
es: Instalado módulo '%s' con la versión '%s'.

source: This module requires '%s' version '%s' and you have version '%s'.
es: Este módulo requiere '%s' versión '%s' y tienes la versión '%s'.

source: This module requires '%s' version '%s' and you don't have it.
es: Este módulo requiere '%s' versiòn '%s' y no lo tienes.

source: Meta file not found at '%s'. Have the package the correct structure?.
es: Meta archivo no encontrado en '%s'. ¿El paquete tiene la estructura correcta?.

source: Install a module.
es: Instala un módulo.

source: Optional path where install the module, relative to Pharinix root path. If not defined the default path is 'usr/'
es: Ruta opcional donde instalar el módulo, relativa al directorio raíz de Pharinix. Si no se define la ruta por defecto es 'usr/'

source: Path to the ZIP file with the new module.
es: Ruta al archivo ZIP con el nuevo módulo.

source: TRUE if the installation is OK.
es: TRUE si la instalación tuvo exito.

source: If install error this contains the error message.
es: Si hubo errores de instalación contiene el mensaje de error.

source: If install ok contains the install path.
es: Si la intalación fue bien contiene la ruta de instalación.

source: List installed modules. Only root can read the list from the database.
es: Lista los módulos instalados. Solo root puede leer la lista desde la base de datos.

source: List of modules.
es: Lista de módulos.

source: Wrong git zip structure, meta file not found.
es: Estructura zip de git erronea, meta archivo no encontrado.

source: Wrong git zip structure.
es: Estructura zip de git erronea.

source: Install a module from GitHub project, it must be from a tag release ZIP file. (Requires cURL.)
es: Instala un módulo desde un proyecto GitHub, debe ser a partir del archivo ZIP de un tag release. (Requiere cURL.)

source: URL of the module's GitHub ZIP file.
es: URL del archivo ZIP de GitHub del módulo­.

source: Module name is required.
es: Se requiere el nombre del módulo.

source: Module not found.
es: Módulo no encontrado.

source: Module name is not unique.
es: El nombre del módulo no es unico.

source: Remove a module.
es: Borrar un módulo.

source: Slugname of the module to uninstall.
es: Slugname del módulo a desinstalar.

source: TRUE if the uninstallation is OK.
es: TRUE si la desinstalación tuvo exito.

source: If uninstall error this contains the error message.
es: Si la desinstalación falló contiene el mensaje de error.

source: Return a new unique ID as string.
es: Devuelve la nueva cadena de ID única.

source: The new unique ID string.
es: La nueva cadena de ID única.

source: I do nothing...
es: No hago nada...

source: Nothing to do
es: No hacer nada

source: Do a direct query to a data base. IMPORTANT: This command is so dangerous !! Protect it with restrictive permissions, only root must execute it.
es: Hace una consulta directa a una base de datos. IMPORTANTE: Este comando es muy peligroso !! Protege este comando con permisos restrictivos, solo root debería ejecutarlo.

source: DB host name.
es: Nombre del servidor

source: Database name.
es: Nombre de la base de datos.

source: Username.
es: Nombre de usuario.

source: Password.
es: Clave.

source: Return the content of the commandDriver register.
es: Devuelve el contenido del registro del controlador de comandos.

source: The commandDriver register array.
es: Arrat del registro del controlador de comandos.

source: Sleep some seconds, no more that 30s.
es: Duerme algunos segundos, no más de 30s.

source: Seconds to sleep, no more that 30.
es: Segundos a dormir, no más de 30.

source: Change the PHP execution time limit. WARNING: Handle with care, a bad use of time limit can halt the server.
es: Cambia el limite de tiempo de ejecución de PHP. PELIGRO: Manejar con cuidado, un mal de uso del limite de tiempo puede bloquear el servidor.

source: Seconds of new execution time limit. If is upper of 7200s, or is 0, the limit is set to 7200s.
es: Segundos del nuevo limite de tiempo de ejecución. Si es superior a 7200s, o es 0, el limite se marcará en 7200s.

source: Translate parameters to JSON string.
es: Traduce sus parametros a una cadena JSON.

source: The json string.
es: La cadena JSON.

source: Add a new trace message
es: Añade un nuevo mensaje de traza.

source: Executed command
es: Executa un comando

source: Array of original parameters
es: Array de parámetros originales

source: Array of responses
es: Array de respuestas

source: Capture final resources consumed
es: Captura los recursos consumidos al final

source: Command not found.
es: Comando no encontrado.

source: Get path where a command is.
es: Obtiene la ruta donde se encuentra el comando.

source: The command's path.
es: La ruta del comando.

source: Section not found.
es: Secciòn no encontrada.

source: Add a comment to configuration.
es: Añade un comentario en la configuración.

source: Section.
es: Sección.

source: Configuration comment.
es: Comentario de configuración.

source: Path required.
es: Ruta requerida.

source: Path not found.
es: Ruta no encontrada.

source: Path included.
es: Ruta incluida.

source: Add a new command path.
es: Añade una nueva ruta de comandos.

source: New path to add.
es: Nueva ruta a añadir.

source: Value of commands path.
es: Valor de la ruta de comandos.

source: Section found.
es: Sección encontrada.

source: Add a new section to configuration.
es: Añade una nueva sección a la configuración.

source: Section name, it must be "[name]".
es: Nombre de sección, debe ser "[nombre]".

source: Del a comment to configuration.
es: Borra un comentario de configuración.

source: Configuration comment to delete.
es: Comentario de configuración a borrar.

source: Del a key/value of configuration.
es: Borrar una clave/valor de configuración.

source: Configuration key to delete.
es: Clave de configuración a borrar.

source: Delete a commands path.
es: Borrar una ruta de comandos.

source: Path to erase.
es: Ruta a borrar.

source: Del a section of configuration, and all her content.
es: Borra una sección de configuración, y todo su contenido.

source: Return configuration file path.
es: Devuelve la ruta del archivo de configuración.

source: Configuration file path.
es: Ruta de archivo de configuración.

source: Return a list of keys in a section in configuration.
es: Devuelve una lista de claves en la sección de configuración.

source: Section to list.
es: Sección a listar.

source: Key not found.
es: Clave no encontrada.

source: Return commands path.
es: Devuelve la ruta de comandos.

source: Return a list of sections in configuration.
es: Devuelve una lista de secciones en la configuración.

source: Array of section names.
es: Arraay de nombres de sección.

source: Return value of a configuration.
es: Devuelve el valor de una configuración.

source: Key to read.
es: Clave a leer.

source: Value of configuration.
es: Valor de configuración.

source: Set, or add, a value of configuration.
es: Modifica, o añade, un valor de configuración.

source: Configuration key.
es: Clave de configuración.

source: Value to write.
es: Valor a escribir.

source: Scan Pharinix to find text in gettext functions: __(), __e(), n__(), n__e(), p__(), p__e(). This explore all PHP and JS files.
es: Escanea Pharinix para encontrar texto en funciones gettext: __(), __e(), n__(), n__e(), p__(), p__e(). Esto explora todos los archivos PHP y JS.

source: Language code of the file.
es: Código de idioma del archivo.

source: Contact information to report translation bugs.
es: Información de contacto donde reportar fallos de traducción.

source: Last translator name and mail.
es: Nombre y correo del último traductor.

source: Language team.
es: Equipo de idioma.

source: Information about each folder scan.
es: Información sobre cada directorio escaneado.

source: PO file is required.
es: Archivo PO requerido.

source: PO file is not writable.
es: No se puede escribir archivo PO.

source: Scan a folder to find text in gettext functions: __(), __e(), n__(), n__e(), p__(), p__e(). This explore all PHP, HTML, HTM and JS files, HTML and HTM files will be explored how a PHP file, please, don't insert JavaScript in it.
es: Escanea un directorio para encontrar texto en funciones gettext: __(), __e(), n__(), n__e(), p__(), p__e(). Esto explora todos los archivos PHP, HTML, HTM y JS, los archivos HTML y HTM serán explorados como archivos PHP, por favor, no inserte JavaScript en él.

source: Root file path to scan, relative to Pharinix root folder.
es: Ruta raíz de archivo a escanear, relativa al directorio raíz de Pharinix.

source: Translated software version.
es: Versión de software traducida.

source: PO file where write results.
es: Archivo PO donde escribir resultados.

source: Number of items before scan.
es: Número de elementos antes del escaneado.

source: Number of items after scan.
es: Número de elementos despues del escaneado.

source: Language is required.
es: Idioma es requerido.

source: Return all Pharinix translation items.
es: Devuelve todos los elementos de traducción de Pharinix.

source: Language code.
es: Código de idioma.

source: List of items translated.
es: Lista de elementos traducidos.

source: Return all translation items.
es: Devuelve todos los elementos de traducción.

source: PO file to read.
es: Archivo PO a leer.

source: Scan a module to find text in gettext functions: __(), __e(), n__(), n__e(), p__(), p__e(). This explore all PHP and JS files.
es: Escanea un módulo para encontrar texto en funciones gettext: __(), __e(), n__(), n__e(), p__(), p__e(). Esto explora todos los archivos PHP y JS.

source: Module slug name.
es: Slugname de módulo.

source: Node type is required.
es: Tipo de nodo requerido.

source: Scan the module's node types to find text in labels and help literals. This use the meta.json file to select node types to explore.
es: Escanea un tipo de nodo de módulo para encontrar texto en literales de etiquetas y ayuda. Esto usa el archivo meta.json para seleccionar los tipos de nodo a explorar.

source: Module to explore.
es: Módulo a explorar.

source: Scan a node type to find text in labels and help literals.
es: Escanea un tipo de nodo para encontrar texto en literales de etiquetas y ayuda.

source: Node type to explore.
es: Explora un tipo de nodo.

source: Original text is required.
es: Texto original es requerido.

source: Original text not found.
es: Texto original no encontrado.

source: Save a translation and compile in a MO file.
es: Guarda una traducción y compila en un archivo MO.

source: Orinignal, english, text.
es: Texto, inglés, original.

source: Tranlated text.
es: Texto traducido.

source: TRUE if ok.
es: TRUE si fue bien.

source: Page not found
es: Página no encontrada.

source: Add a block to a page.
es: Añade un bloque a una página.

source: Name ID of page.
es: Nombre de página.

source: Column ID where put the block.
es: ID de columna donde poner el bloque.

source: Command to execute.
es: Comando a ejecutar.
