Repository: DomingoLlanes/pharinix
Catalog: etc/i18n/*.po
Languages: es

source: Delete a user by ID or mail.
es: Borrar un usuario por su ID o correo.

source: The user id.
es: El id de usuario.

source: Close the user session.
es: Cerrar la sesión de usuario.

source: Return user session data. Warning! It can display sensible data.
es: Devuelve datos de sesión de usuario. Peligro! Puede contener información sensible.

source: Session array
es: Array de sesión

source: Set the session language.
es: Configura el idioma de sesión.

source: The language code, if is '' then set the client default languages.
es: El código de idioma, si es '' entonces configura el idioma por defecto del cliente.

source: The session language set.
es: Configura el idioma de sesión.

source: Start the user session.
es: Inicia una sesión de usuario.

source: User password to login.
es: Clave de usuario para entrar.

source: TRUE if session started.
es: TRUE si la sesión se inició.

source: Session ID to use how auth_token.
es: ID de sesión a usar como auth_token.

source: Change active user without logout and login. This is the unique method to get root access, super administration. A user can do sudo when it have sudoers group.
es: Cambia el usuario activo sin salir y entrar. Este es el único metodo para obtener acceso como root, super adminitración. Un usuario puede hacer sudo cuando tiene el grupo sudoers.

source: User email to supplant. Root is 'root@localhost'. If this parameter is empty then we exit sudo.
es: Correo del usuario a suplantar. Root es 'root@localhost'. Si este parámetro está vacío entonces salimos de sudo.

source: Scan a folder to find text in gettext functions: __(), __e(), n__(), n__e(), p__(), p__e(). This explore all PHP and JS files.
es: Escanea un directorio para encontrar texto en funciones gettext: __(), __e(), n__(), n__e(), p__(), p__e(). Esto explora archivos PHP y JS.

source: Package path '%s'
es: Ruta del paquete '%s'

source: Command '%s'
es: Comando '%s' no encontrado
