Repository: DomingoLlanes/pharinix
Catalog: etc/i18n/*.po
Languages: es

source: Parameters of command, it must be a URL encoded string.
es: Parámetros de comando, debe ser una cadena codificada como URL.

source: Order of blocks. Default 0, first.
es: Orden de bloques. Por defecto 0, el primero.

source: Page template '%s' not found.
es: Plantilla de página '%s' no encontrada.

source: Page need a unique name.
es: La página necesita un nombre único.

source: Page name just exist.
es: El nombre de página ya existe.

source: Add a new page.
es: Añade una nueva página.

source: ID of page.
es: ID de página.

source: Optional, path to the XML template file.
es: Opcional, ruta del archivo XML de plantilla.

source: Page title.
es: Titulo de página.

source: Page description.
es: Descripción de página.

source: Page meta key words.
es: Meta palabras clave de página.

source: Optional page URL.
es: URL de página opcional.

source: Command's list
es: Lista de comandos.

source: Module '%s'
es: Módulo '%s'

source: Licence: %s
es: Licencia: '%s'

source: %s version %s, %s
es: %s versión %s, %s

source: See more information.
es: Ver más información.

source: It add %s command(s)
es: Añade %s comando(s)

source: Parameters
es: Parámetros

source: Responses
es: Respuestas

source: Permissions
es: Permisos

source: Flags
es: Banderas

source: Display commands help.
es: Muestra la ayuda del comando.

source: Export commands help to a GitHub Wiki file.
es: Exporta la ayuda de los comandos a un archivo Wiki de GitHub.

source: File path where export.
es: Ruta de archivo donde exportar.

source: Del a page.
es: Borrar una página.

source: Eval, echo, a HTML+PHP code
es: Evalua, muestra, código HTML+PHP.

source: String to evaluate.
es: Cadena a evaluar.

source: Show a form to execute a command.
es: Muestra un formulario para ejecutar un comando.

source: Direct command
es: Comando directo

source: POST's parameters
es: Parámetros POST.

source: Post's parameters encoded as string.
es: Parámetros POST codificados como cadena.

source: Command's help
es: Ayuda de comando

source: Executed
es: Ejecutado

source: Show a form to define the command to execute.
es: Muestra un formulario para definir el comando a ejecutar.

source: Echo base javascript assets with a content-type header of application/javascript.
es: Muestra recursos base de javascript con una cabecera de tipo de contenido application/javascript.

source: Display reference icon's list.
es: Muestra una lista de iconos de referencia.

source: Command help
es: Ayuda de comando

source: Help
es: Ayuda

source: Show a form to get help about a command.
es: Muestra un formulario para obtener ayuda sobre un comando.

source: Description
es: Descripción

source: Echo help about a command how HTML. Ex. manHTML ('cmd' => 'manHTML'), echo this help.
es: Muestra ayuda sobre un comando como HTML. Ej. manHTML('cmd' => 'manHTML'), muestra esta ayuda.

source: Home
es: Inicio

source: Exit superuser
es: Salir de superusuario

source: Get superuser
es: Obtener superusuario

source: mail
es: correo

source: password
es: clave

source: Login
es: Entrar

source: Logout
es: Salir

source: Console
es: Consola

source: Commands
es: Comandos

source: Formatters demo
es: Demo de formateadores

source: Bootstrap icons
es: Iconos Bootstrap

source: Tabs & Panels
es: Pestañas y paneles

source: UI Elements
es: Elementos de IU

source: Forms
es: Formularios

source: Types
es: Tipos

source: Visible types
es: Tipos visibles

source: Fixed types
es: Tipos fijos

source: Transform a menu to HTML inline navigation bar
es: Transforma un menú a una barra de nevegación HTML en linea

source: Menu to convert.
es: Menú a convertir

source: row ID
es: ID de fila

source: Col ID
es: ID de columna

source: Page '%s' not found.
es: Página '%s' no contrada.

source: Transform a page to HTML
es: Transforma una página a HTML

source: Page to convert, see 'url_rewrite' table.
es: Página a convertir, ver tabla 'url_rewrite'.

source: Display phpInfo() response.
es: Muestra la respuesta de phpInfo().

source: Echo a list of URLs in the system.
es: Muestra un listado de URLs de sistema.

source: Template editor
es: Editor de plantilla

source: With this editor you can define the page distribution, In it you can define spaces to put one or more blocks, with help of commands. If you like a footer, you only need define her ID to 'footer', to define duplicate contents can put the some ID to two or more columns. If not ID is defined the column not can get blocks on it.
es: Con este editor puedes definir la distribución de página, en él puedes definir espacios para poner uno o mas bloques, con ayuda de comandos. Si quieres un pie de página, solo necesitas definir su ID a 'footer', para contenido duplicado puede poner el mismo ID a dos o mas columnas. Si no se define una ID la columna no podrá contener bloques.

source: To start creating the template press any of the numeric buttons.
es: Para empezar a crear una plantilla pulse cualquier botón numerico.

source: Edit Source Code
es: Editar código fuente

source: Preview
es: Vista previa

source: Desktop
es: Escritorio

source: Phone
es: Teléfono

source: Toggle Dropdown
es: Cambiar desplegable

source: Reset Grid
es: Reiniciar rejilla

source: Reset
es: Reiniciar

source: This template need a name.
es: Esta plantilla necesita un nombre.

source: This template is empty.
es: Esta plantilla está vacía.

source: Template name
es: Nombre de plantilla

source: name
es: nombre

source: Default title
es: Titulo por defecto

source: Head includes
es: Cabeceras incluidas

source: The default values are required, You don't must change this if you don't know how.
es: El valor por defecto es requerido, No debes cambiarlo si no sabes como.

source: Save
es: Guardar

source: Load template
es: Cargar plantilla

source: Load
es: Cargar

source: Changes will be loosed.
es: Se perderán los cambios

source: Show template grid editor.
es: Mostrar rejilla de edición de plantilla

source: Echo a json list of templates. ['default', ...]}
es: Muestra una lista json de plantillas. ['default', ...]}

source: Name or tpl is empty.
es: Nombre o tpl está vacío.

source: Save a user template from the template editor.
es: Guarda una plantilla de usuario desde el editor de plantillas.

source: Base 64 encoded HTML definition of the template.
es: HTML de definición de plantilla codificada en base 64.

source: Template name, It must be a compatible file name.
es: Nombre de plantilla, debe ser un nombre de archivo compatible.

source: Template default title.
es: Titulo por defecto de plantilla.

source: Base 64 encoded meta information to add to the HTML head area.
es: Meta información codificada en base 64 a añadir a la cabecera HTML.

source: TRUE if is ok.
es: TRUE si fue bien.

source: In case of error the error message.
es: En caso de error el mensaje de error.

source: Transform a XML template to HTML, it not build blocks.
es: Transforma una plantilla XML a HTML, no construye bloques.

source: XML to convert
es: XML a convertir

source: Template name.
es: Nombre de plantilla.

source: Default page title.
es: Titulo de página por defecto.

source: Head content
es: Contenido de cabecera

source: Body structure in HTML, it's parsed to template editor.
es: Estructura del cuerpo HTML, es interpretada para el editor de plantilla.

source: URL Decoder/Encoder
es: Codificador/Decodificador de URL

source: Decode
es: Decodificar

source: Encode
es: Codificar

source: Input a string of text and encode or decode it as you like.
es: Introduzca una cadena de texto y codifique o decodifique como quiera.

source: The URL Decoder/Encoder is licensed under a Creative Commons %s License.
es: El codificador/decodificador de URL está bajo licencia Creative Commons %s.

source: Encode/Decode a string as a URL.<p>The URL Decoder/Encoder is licensed under a Creative Commons Attribution-ShareAlike 2.0 License, http://creativecommons.org/licenses/by-sa/2.0/, by Eric Meyer, http://meyerweb.com/eric/tools/dencoder/.
es: Codifica/Decodifica una cadena como URL. <p>El codificador/decodificador de URL está licenciado bajo licencia Creative Commons Attribution-ShareAlike 2.0, http://creativecommons.org/licenses/by-sa/2.0/, por Eric Meyer, http://meyerweb.com/eric/tools/dencoder/.

source: Trace information
es: Información de traza

source: Print trace information in HTML format
es: Imprimi información de traza en formato HTML.

source: Key
es: Clave

source: Resources used by Pharinix
es: Recursos usados como Pharinix

source: Memory
es: Memoria

source: Time
es: Tiempo

source: Print resource consume in HTML format
es: Imprimir recursos consumidos en formato HTML

source: 'cmd' is required.
es: 'cmd' es requerido.

source: 'type' is required.
es: 'type' es requerido.

source: This formatter can't do nothing.
es: Este formateador no puede hacer nada.

source: Duplicated formatter.
es: Formateador duplicado.

source: Add a new field formatter.
es: Añade un nuevo formateador de campo.

source: Command that can format the field.
es: Comando que puede formatear el campo.

source: Basic type to format.
es: Tipo básico a formatear.

source: Can format field to read only.
es: Puede formatear campos en solo lectura.

source: Can format field to read & write.
es: Puede formatear campos en lectura y escritura.

source: This formatter is the default formatter to this type.
es: Este formateador es el formateador por defecto para este tipo.

source: Node type required
es: Tipo de nodo requerido

source: Unknowed node type '%s'
es: Tipo de nodo '%s' desconocido

source: Missing node field required.
es: Campo de nodo perdido es requerido.

source: Field '%s' are not fields of '%s' node type.
es: Campo '%s' no pertenece a los campos de tipo de nodo '%s'.

source: Duplicate keys.
es: Claves duplicadas.

source: You can't add nodes.
es: No puede añadir nodos.

source: Add a new node.
es: Añade un nuevo nodo.

source: A parameter for each field of the type.
es: Un parámetro por cada campo del tipo.

source: Node type is from.
es: Origen del tipo de nodo.

source: True/False node added
es: Nodo añadido True/False.

source: If error, it's a message about error
es: Si hubo error, es el mensaje acerca del error

source: ID of new node
es: ID del nuevo nodo

source: Field name is required.
es: Nombre de campo requerido.

source: Field type is required.
es: Tipo de campo es requerido.

source: Node type is required.
es: Tipo de nodo es requerido.

source: Node field sub type '%s' don't exist.
es: Subtipo de campo de nodo '%s' no existe.

source: Node field name '%s' already exist.
es: Nombre de campo de nodo '%s' ya existe.

source: You can't add fields to '%s'.
es: No puedes añadir campos a '%s'.

source: Node type '%s' don't exist.
es: Tipo de nodo '%s' no existe.

source: Add a new field to a node type. It need update permission over the node type.
es: Añade un nuevo campo a un tipo de nodo. Se necesita permido de actualización sobre el tipo de nodo.

source: Field name
es: Nombre de campo

source: Field type: longtext, bool, datetime, double, integer, string, password, htmltext, nodesec or other node type
es: Tipo de campo: longtext, bool, datetime, double, integer, string, password, htmltext, nodesec o otro tipo de nodo

source: Any other record can have some value. This functionality is not using database implementation.
es: Cualquier otro registro puede tener el mismo valor. Esta funcionalidad no está usando implementación de base de datos.

source: Field length if need it
es: Longitud de campo si lo necesita

source: True/false Required field
es: True/False Campo requerido

source: True/false Not writable field
es: True/False Campo no escribible

source: True/false System field
es: True/False Campo de sistema

source: True/false multivalue field, only applicable on relations with other node types.
es: True/False Campo multivalor, solo se aplica sobre relaciones con otros tipos de nodo.

source: Node type name
es: Nombre del tipo de nodo

source: Default value
es: Valor por defecto

source: Label to show
es: Etiqueta a mostrar

source: Help about field
es: Ayuda sobre el campo

source: True/False field added
es: True/False Campo añadido

source: Node type name is a protected name.
es: Nombre de tipo de nodo es un nombre protegido.

source: Node type name is required.
es: Nombre de tipo de nodo requerido.

source: Add a new node type, with a default string field with name 'title'.
es: Añade un nuevo tipo de nodo, con un campo de texto con nombre 'title' por defecto.

source: True/false System field. Optional, default false.
es: True/False Campo del sistema. Opcional, por defecto false.

source: Name of the field used how label to list nodes. Optional, default 'title'.
es: Nombre del campo usado como etiqueta al listar nodos. Opcional, por defecto 'title'.

source: ID of new node type
es: ID del nuevo tipo de nodo

source: Bad node type id.
es: Mala ID de tipo de nodo.

source: unknown node or you can't read.
es: Nodo desconocido o no puedes leerlo.

source: To change permission of node type or node that is owned by you.
es: Para cambiar permisos de tipo de nodo o de nodo del que eres propietario.

source: Node type that you need change permission.
es: Tipo de nodo al que necesitas cambiar permisos.

source: Node ID of the node that you need change. Optional, if it's set try change a node, else try change a node type.
es: ID del nodo que necesitas cambiar. Opcional, Si está definido intenta cambiar un nodo, sino intenta cambiar un tipo de nodo.

source: To change owner, and/or group, of the node types or nodes.
es: Para cambiar propietario, y/o grupo, del tipo de nodo o nodo.

source: Node type that you need change ownership or type of the node to change.
es: Tipo de nodo al que necesitas cambiar el propietario o tipo del nodo a cambiar.

source: Mail of the user or ID of the new owner. If it's null, or it is not set, command don't change it, to set to root you must value how 0, zero.
es: Correo del usuario o ID del nuevo propietario. Si es null, o si no se define, el comando no lo cambia, para asignar a root debe pasar el valor 0, cero.

source: Title or ID of the group. If it's null, or it is not set, command don't change it, to set to root you must value how 0, zero.
es: Titulo o ID del grupo. Si es null, o si no se especifica, el comando no lo cambia, para indicar root debes pasar el valor 0, cero.

source: Node ID required
es: ID de nodo es requerido.

source: You can't delete nodes.
es: No puedes borrar nodos.

source: Delete a node.
es: Borra un nodo.

source: Node ID to erase.
es: ID del nodo a borrar.

source: True/False node erased
es: True/False nodo borrado

source: Erase a node field. It need delete permission over the node type.
es: Borra un campo de nodo. Necesita permiso de borrado sobre el tipo de nodo.

source: Node field name to erase
es: Nombre del campo de nodo a borrar

source: Erase a node type. Note: This command alter the execution time limit and reset it to the php.ini default value.
es: Borra un tipo de nodo. Nota: Este comando altera el limite de ejecución y lo reinicia al valor por defecto de php.ini.

source: Node type to erase.
es: Tipo de nodo a borrar.

source: Object of call must be read or write.
es: El objetivo de la llamada debe ser lectura o escritura.

source: Format boolean field to read or write.
es: Formatea campo booleano como lectura o escritura.

source: Field name to the form control.
es: Nombre de campo del control de formulario.

source: Caller need a read form.
es: El llamador necesita un formulario de lectura.

source: Caller need a write form.
es: El llamador necesita un formulario de escritura.

source: Field value.
es: Valor de campo.

source: Field max length.
es: Longitud máxima de campo.

source: Is a required field.
es: Es un campo requerido.

source: Is a read only field.
es: Es un campo de solo lectura.

source: Is a system field, it isn't allow write.
es: Es un campo de sistema, no permite escritura.

source: Is a multi valued field.
es: Es un campo multivalor.

source: Default value.
es: Valor por defecto.

source: Label.
es: Etiqueta.

source: Help to write forms.
es: Ayuda a escribir formularios.

source: Format datetime field to read or write how date.
es: Formatea un campo datetime a leer o escribir como fecha.

source: Format decimal field to read or write.
es: Formatea un campo decimal para leer o escribir.

source: Format HTML text field to read or write.
es: Formatea un campo de texto HTML para leer o escribir.

source: Format integer field to read or write.
es: Formatea un campo entero para lectura o escritura.

source: Format longtext field to read or write.
es: Formatea un campo de texto largo para lectura o escritura.

source: Enter Password...
es: Introduzca clave...

source: Format password field to read or write.
es: Formatea un campo de clave para lectura o escritura.

source: Format string field to read or write.
es: Formatea un campo de cadena para lectura o escritura.

source: Return the node content.
es: Devuelve el contenido del nodo.

source: Node type.
es: Tipo de nodo.

source: Node ID.
es: ID de nodo.

source: Array with node content indexed by field name.
es: Array con el contenido del nodo indexado por el nombre de campo.

source: Show node content in HTML.
es: Muestra el contenido del nodo como HTML.

source: Node type '%s' not found.
es: Tipo de nodo '%s' no encontrado.

source: Return list of nodes from a node type. All field's names must be enclosed with '`'
es: Devuelve una lista de nodos de un tipo de nodo. Todos los nombres de campo deben encerrarse con '´'

source: Bool, If true then return number, in a 'amount' field, of nodes but without node data.
es: Booleano, Si true entonces devuelve un número, en un campo 'amount', de nodos pero sin datos del nodo.

source: Comma separated string list. Optional, default '*'.
es: Lista de cadenas separadas por comas. Opcional, por defecto '*'.

source: Where condition.
es: Condicion where.

source: Order by fields.
es: Campos ordenados por.

source: Group by fields.
es: Campos agrupados por.

source: Index of first node to return. Optional, default 0.
es: Indice del primer nodo a devolver. Opcional, por defecto 0.

source: Number of nodes to return from the offset. Optional, default 100.
es: Número de nodos a devolver desde el offset. Opcional, por defecto 100.

source: Node array with the ID how index. Multivalued fields will be returned how related ID's array.
es: Array del nodo con la ID como indice. Campos multivalor serán devueltos como array de IDs relacionadas.

source: Get array definition of node type.
es: Obtiene array de definición como tipo de nodo.

source: Node type ID
es: ID del tipo de nodo

source: True/false, is a system node type?
es: True/False, ¿es un tipo de nodo del sistema?

source: Name of field used how label to lists.
es: Nombre del campo usado como etiqueta para listados.

source: Array with field's definitions. Each field is a array with this elements: 'name', 'type', 'iskey', 'len', 'required', 'readonly', 'locked', 'default', 'label', 'help', 'multi'.
es: Array con definiciones de campo. Cada campo es un array con estos elementos: 'name', 'type', 'iskey', 'len', 'required', 'readonly', 'locked', 'default', 'label', 'help', 'multi'.

source: Creation date.
es: Fecha de creación.

source: Creator ID.
es: ID del creador.

source: Modification date.
es: Fecha de modificación.

source: Modifier ID.
es: ID del modificador.

source: ID of owner user.
es: ID del usuario propietario.

source: ID of owner group.
es: ID del grupo propietario.

source: Access flags. (nodesec)
es: Banderas de acceso. (nodesec)

source: Node type '%s'
es: Tipo de nodo '%s'

source: Fields
es: Campos

source: Name
es: Nombre

source: Type
es: Tipo

source: Is key
es: Es clave

source: length
es: Longitud

source: Required
es: Requerido

source: Locked
es: Bloqueado

source: Read only
es: Solo lectura

source: System
es: Sistema

source: Multivalued
es: Multivalor

source: Default
es: Por defecto

source: Label
es: Etiqueta

source: This is a system node type.
es: Este es un tipo de nodo de sistema.

source: Created by '%s' in %s, modified by '%s' in %s.
es: Creado por '%s' el %s, modificado por '%s' el %s.

source: Contains %s record/s.
es: contiene %s registros/s.

source: Permisions
es: Permisos

source: Display definition of node type.
es: Muestra la definición de un tipo de nodo.

source: Search ID of node type by name
es: Busca el ID de tipo de nodo por nombre

source: Node type name to search.
es: Nombre del tipo de nod a buscar.

source: ID of the node type. False if not found.
es: ID del tipo de nodo. False si no encontrado.

source: Return a list of node types.
es: Devuelve una lista de tipos de nodos.

source: Array with node type names.
es: Array con nombres de tipos de nodos.

source: Identify a field's node type how basic type or it's a reference to another node type.
es: Identifica un campo de tipo de nodo como tipo básico o si es una referencia a otro tipo de nodo.

source: The type name to test.
es: El tipo de nodo a probar.

source: True/False is a basic type
es: True/False es un tipo básico

source: Unknowed node ID
es: ID de nodo desconocido

source: You can't update nodes.
es: No puedes modificar nodos.

source: Update a node
es: Modifica un nodo

source: Node type of node to update.
es: Tipo de nodo del nodo a modificar.

source: ID of node.
es: ID de nodo.

source: True/False node updated
es: True/False nodo modificado

source: URL or CMD is empty.
es: URL o CMD está vacío.

source: URL just existe.
es: URL ya existe.

source: Add a new URL to the rewrite list.
es: Añade una nueva URL a la lista rewrite.

source: The new URL, relative at root. Ex. home to http://127.0.0.1/home
es: La nueva URL, relativa a la raíz. Ej. home para http://127.0.0.1/home

source: POST's encoded string with command and parameters. Ex. command=pageToHTML&page=home
es: Cadena codificada como POST con el comando y los parámetros. Ej. command=pageToHTML&page=home

source: TRUE if new URL added.
es: TRUE si se añadió la nueva URL.

source: If FALSE contain the error message.
es: Si FALSE contiene el mensaje de error.

source: Del URL to the rewrite list.
es: Borra URL de la lista rewrite.

source: The URL to erase, relative at root. Ex. home to http://127.0.0.1/home
es: La URL a borrar, relativa a la raíz. Ej. home para http://127.0.0.1/home

source: Return a complete list of URL rewrites.
es: Devuelve una lista completa de URLs reescritas.

source: List of URLs
es: Lista de URLs

source: Query the rewrite list and return if the url is rewrited.
es: Consulta la lista de reescritura y devuelve si la url está reescrita.

source: The URL to test.
es: La URL a probar.

source: TRUE if the URL exist.
es: TRUE si la URL existe.

source: User name required.
es: Nombre de usuario requerido.

source: User mail required.
es: Correo de usuario requerido.

source: 'root@localhost' is in use.
es: 'root@localhost' está en uso.

source: User title required.
es: Titulo de usuario requerido.

source: User password required.
es: Clave de usuario requerida.

source: Mail or group in use.
es: Correo o grupo está en uso.

source: Add a new user. All parameters are requires.
es: Añade un nuevo usuario. Todos los parámetros son requeridos.

source: The user mail.
es: El correo de usuario.

source: The password in plain text.
es: La clave en texto plano.

source: User name or nick, used how default group name too.
es: Nombre de usuario o nick, usado tambien como grupo por defecto.

source: User complete name.
es: Nombre completo de usuario.

source: TRUE if the user is added.
es: TRUE si el usuario se añadió.

source: If ok is FALSE contains the error message.
es: Si ok es FALSE contiene el mensaje de error.

source: If ok is TRUE contains the new user ID.
es: Si ok es TRUE contiene la nueva ID de usuario.
